facebook/fboss/fboss/agent/platforms/common/m4062nhp/M4062nhpPlatformMapping.cpp
              }
          },
          "47": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 0
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 0
                    }
                  }
                ]
              }
          },
          "50": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 3
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 4
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 5
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 6
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core1",
                      "lane": 7
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 3
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 4
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 5
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 6
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip23",
                      "lane": 7
                    }
                  }
                ]
              }
          }
        }
    },
    "19": {
        "mapping": {
          "id": 19,
          "name": "eth1/24/1",
          "controllingPort": 19,
          "pins": [
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 0
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 0
                }
              }
            },
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 1
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 1
                }
              }
            },
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 2
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 2
                }
              }
            },
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 3
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 3
                }
              }
            },
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 4
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 4
                }
              }
            },
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 5
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 5
                }
              }
            },
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 6
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 6
                }
              }
            },
            {
              "a": {
                "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                "lane": 7
              },
              "z": {
                "end": {
                  "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                  "lane": 7
                }
              }
            }
          ],
          "portType": 0,
          "scope": 0
        },
        "supportedProfiles": {
          "23": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 3
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 3
                    }
                  }
                ]
              }
          },
          "25": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 3
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 3
                    }
                  }
                ]
              }
          },
          "38": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 0
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 1
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 2
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 3
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 3
                    }
                  }
                ]
              }
          },
          "39": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 0
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 1
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 2
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 3
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 4
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 5
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 6
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 7
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 3
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 4
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 5
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 6
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 7
                    }
                  }
                ]
              }
          },
          "45": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 3
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 3
                    }
                  }
                ]
              }
          },
          "47": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 0
                    },
                    "tx": {
                      "pre": -18,
                      "pre2": 2,
                      "main": 132,
                      "post": -14,
                      "post2": 0,
                      "post3": 0,
                      "pre3": 0
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 0
                    }
                  }
                ]
              }
          },
          "50": {
              "pins": {
                "iphy": [
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 3
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 4
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 5
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 6
                    }
                  },
                  {
                    "id": {
                      "chip": "NPU-TH6_NIF-slot1/chip1/core5",
                      "lane": 7
                    }
                  }
                ],
                "transceiver": [
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 0
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 1
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 2
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 3
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 4
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 5
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 6
                    }
                  },
                  {
                    "id": {
                      "chip": "TRANSCEIVER-OSFP-slot1/chip24",
                      "lane": 7
                    }
                  }
                ]
              }
          }
        }
    },
    "20": {
