facebook/fboss/fboss/agent/platforms/common/m4062nhp/M4062nhpPlatformMapping.cpp
      "physicalID": 1
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core2",
      "type": 1,
      "physicalID": 2
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core3",
      "type": 1,
      "physicalID": 3
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core4",
      "type": 1,
      "physicalID": 4
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core5",
      "type": 1,
      "physicalID": 5
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core6",
      "type": 1,
      "physicalID": 6
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core7",
      "type": 1,
      "physicalID": 7
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core8",
      "type": 1,
      "physicalID": 8
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core9",
      "type": 1,
      "physicalID": 9
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core10",
      "type": 1,
      "physicalID": 10
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core11",
      "type": 1,
      "physicalID": 11
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core12",
      "type": 1,
      "physicalID": 12
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core13",
      "type": 1,
      "physicalID": 13
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core14",
      "type": 1,
      "physicalID": 14
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core15",
      "type": 1,
      "physicalID": 15
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core16",
      "type": 1,
      "physicalID": 16
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core17",
      "type": 1,
      "physicalID": 17
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core18",
      "type": 1,
      "physicalID": 18
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core19",
      "type": 1,
      "physicalID": 19
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core20",
      "type": 1,
      "physicalID": 20
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core21",
      "type": 1,
      "physicalID": 21
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core22",
      "type": 1,
      "physicalID": 22
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core23",
      "type": 1,
      "physicalID": 23
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core24",
      "type": 1,
      "physicalID": 24
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core25",
      "type": 1,
      "physicalID": 25
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core26",
      "type": 1,
      "physicalID": 26
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core27",
      "type": 1,
      "physicalID": 27
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core28",
      "type": 1,
      "physicalID": 28
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core29",
      "type": 1,
      "physicalID": 29
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core30",
      "type": 1,
      "physicalID": 30
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core31",
      "type": 1,
      "physicalID": 31
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core32",
      "type": 1,
      "physicalID": 32
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core33",
      "type": 1,
      "physicalID": 33
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core34",
      "type": 1,
      "physicalID": 34
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core35",
      "type": 1,
      "physicalID": 35
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core36",
      "type": 1,
      "physicalID": 36
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core37",
      "type": 1,
      "physicalID": 37
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core38",
      "type": 1,
      "physicalID": 38
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core39",
      "type": 1,
      "physicalID": 39
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core40",
      "type": 1,
      "physicalID": 40
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core41",
      "type": 1,
      "physicalID": 41
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core42",
      "type": 1,
      "physicalID": 42
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core43",
      "type": 1,
      "physicalID": 43
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core44",
      "type": 1,
      "physicalID": 44
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core45",
      "type": 1,
      "physicalID": 45
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core46",
      "type": 1,
      "physicalID": 46
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core47",
      "type": 1,
      "physicalID": 47
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core48",
      "type": 1,
      "physicalID": 48
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core49",
      "type": 1,
      "physicalID": 49
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core50",
      "type": 1,
      "physicalID": 50
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core51",
      "type": 1,
      "physicalID": 51
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core52",
      "type": 1,
      "physicalID": 52
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core53",
      "type": 1,
      "physicalID": 53
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core54",
      "type": 1,
      "physicalID": 54
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core55",
      "type": 1,
      "physicalID": 55
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core56",
      "type": 1,
      "physicalID": 56
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core57",
      "type": 1,
      "physicalID": 57
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core58",
      "type": 1,
      "physicalID": 58
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core59",
      "type": 1,
      "physicalID": 59
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core60",
      "type": 1,
      "physicalID": 60
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core61",
      "type": 1,
      "physicalID": 61
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core62",
      "type": 1,
      "physicalID": 62
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core63",
      "type": 1,
      "physicalID": 63
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core64",
      "type": 1,
      "physicalID": 64
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core65",
      "type": 1,
      "physicalID": 65
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core66",
      "type": 1,
      "physicalID": 66
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core67",
      "type": 1,
      "physicalID": 67
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core68",
      "type": 1,
      "physicalID": 68
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core69",
      "type": 1,
      "physicalID": 69
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core70",
      "type": 1,
      "physicalID": 70
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core71",
      "type": 1,
      "physicalID": 71
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core72",
      "type": 1,
      "physicalID": 72
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core73",
      "type": 1,
      "physicalID": 73
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core74",
      "type": 1,
      "physicalID": 74
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core75",
      "type": 1,
      "physicalID": 75
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core76",
      "type": 1,
      "physicalID": 76
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core77",
      "type": 1,
      "physicalID": 77
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core78",
      "type": 1,
      "physicalID": 78
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core79",
      "type": 1,
      "physicalID": 79
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core80",
      "type": 1,
      "physicalID": 80
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core81",
      "type": 1,
      "physicalID": 81
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core82",
      "type": 1,
      "physicalID": 82
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core83",
      "type": 1,
      "physicalID": 83
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core84",
      "type": 1,
      "physicalID": 84
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core85",
      "type": 1,
      "physicalID": 85
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core86",
      "type": 1,
      "physicalID": 86
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core87",
      "type": 1,
      "physicalID": 87
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core88",
      "type": 1,
      "physicalID": 88
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core89",
      "type": 1,
      "physicalID": 89
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core90",
      "type": 1,
      "physicalID": 90
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core91",
      "type": 1,
      "physicalID": 91
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core92",
      "type": 1,
      "physicalID": 92
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core93",
      "type": 1,
      "physicalID": 93
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core94",
      "type": 1,
      "physicalID": 94
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core95",
      "type": 1,
      "physicalID": 95
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core96",
      "type": 1,
      "physicalID": 96
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core97",
      "type": 1,
      "physicalID": 97
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core98",
      "type": 1,
      "physicalID": 98
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core99",
      "type": 1,
      "physicalID": 99
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core100",
      "type": 1,
      "physicalID": 100
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core101",
      "type": 1,
      "physicalID": 101
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core102",
      "type": 1,
      "physicalID": 102
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core103",
      "type": 1,
      "physicalID": 103
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core104",
      "type": 1,
      "physicalID": 104
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core105",
      "type": 1,
      "physicalID": 105
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core106",
      "type": 1,
      "physicalID": 106
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core107",
      "type": 1,
      "physicalID": 107
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core108",
      "type": 1,
      "physicalID": 108
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core109",
      "type": 1,
      "physicalID": 109
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core110",
      "type": 1,
      "physicalID": 110
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core111",
      "type": 1,
      "physicalID": 111
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core112",
      "type": 1,
      "physicalID": 112
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core113",
      "type": 1,
      "physicalID": 113
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core114",
      "type": 1,
      "physicalID": 114
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core115",
      "type": 1,
      "physicalID": 115
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core116",
      "type": 1,
      "physicalID": 116
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core117",
      "type": 1,
      "physicalID": 117
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core118",
      "type": 1,
      "physicalID": 118
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core119",
      "type": 1,
      "physicalID": 119
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core120",
      "type": 1,
      "physicalID": 120
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core121",
      "type": 1,
      "physicalID": 121
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core122",
      "type": 1,
      "physicalID": 122
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core123",
      "type": 1,
      "physicalID": 123
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core124",
      "type": 1,
      "physicalID": 124
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core125",
      "type": 1,
      "physicalID": 125
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core126",
      "type": 1,
      "physicalID": 126
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core127",
      "type": 1,
      "physicalID": 127
    },
    {
      "name": "NPU-TH6_NIF-slot1/chip1/core128",
      "type": 1,
      "physicalID": 128
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip1",
      "type": 3,
      "physicalID": 0
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip2",
      "type": 3,
      "physicalID": 1
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip3",
      "type": 3,
      "physicalID": 2
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip4",
      "type": 3,
      "physicalID": 3
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip5",
      "type": 3,
      "physicalID": 4
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip6",
      "type": 3,
      "physicalID": 5
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip7",
      "type": 3,
      "physicalID": 6
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip8",
      "type": 3,
      "physicalID": 7
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip9",
      "type": 3,
      "physicalID": 8
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip10",
      "type": 3,
      "physicalID": 9
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip11",
      "type": 3,
      "physicalID": 10
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip12",
      "type": 3,
      "physicalID": 11
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip13",
      "type": 3,
      "physicalID": 12
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip14",
      "type": 3,
      "physicalID": 13
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip15",
      "type": 3,
      "physicalID": 14
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip16",
      "type": 3,
      "physicalID": 15
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip17",
      "type": 3,
      "physicalID": 16
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip18",
      "type": 3,
      "physicalID": 17
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip19",
      "type": 3,
      "physicalID": 18
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip20",
      "type": 3,
      "physicalID": 19
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip21",
      "type": 3,
      "physicalID": 20
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip22",
      "type": 3,
      "physicalID": 21
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip23",
      "type": 3,
      "physicalID": 22
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip24",
      "type": 3,
      "physicalID": 23
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip25",
      "type": 3,
      "physicalID": 24
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip26",
      "type": 3,
      "physicalID": 25
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip27",
      "type": 3,
      "physicalID": 26
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip28",
      "type": 3,
      "physicalID": 27
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip29",
      "type": 3,
      "physicalID": 28
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip30",
      "type": 3,
      "physicalID": 29
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip31",
      "type": 3,
      "physicalID": 30
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip32",
      "type": 3,
      "physicalID": 31
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip33",
      "type": 3,
      "physicalID": 32
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip34",
      "type": 3,
      "physicalID": 33
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip35",
      "type": 3,
      "physicalID": 34
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip36",
      "type": 3,
      "physicalID": 35
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip37",
      "type": 3,
      "physicalID": 36
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip38",
      "type": 3,
      "physicalID": 37
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip39",
      "type": 3,
      "physicalID": 38
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip40",
      "type": 3,
      "physicalID": 39
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip41",
      "type": 3,
      "physicalID": 40
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip42",
      "type": 3,
      "physicalID": 41
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip43",
      "type": 3,
      "physicalID": 42
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip44",
      "type": 3,
      "physicalID": 43
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip45",
      "type": 3,
      "physicalID": 44
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip46",
      "type": 3,
      "physicalID": 45
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip47",
      "type": 3,
      "physicalID": 46
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip48",
      "type": 3,
      "physicalID": 47
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip49",
      "type": 3,
      "physicalID": 48
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip50",
      "type": 3,
      "physicalID": 49
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip51",
      "type": 3,
      "physicalID": 50
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip52",
      "type": 3,
      "physicalID": 51
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip53",
      "type": 3,
      "physicalID": 52
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip54",
      "type": 3,
      "physicalID": 53
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip55",
      "type": 3,
      "physicalID": 54
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip56",
      "type": 3,
      "physicalID": 55
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip57",
      "type": 3,
      "physicalID": 56
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip58",
      "type": 3,
      "physicalID": 57
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip59",
      "type": 3,
      "physicalID": 58
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip60",
      "type": 3,
      "physicalID": 59
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip61",
      "type": 3,
      "physicalID": 60
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip62",
      "type": 3,
      "physicalID": 61
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip63",
      "type": 3,
      "physicalID": 62
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip64",
      "type": 3,
      "physicalID": 63
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip65",
      "type": 3,
      "physicalID": 64
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip66",
      "type": 3,
      "physicalID": 65
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip67",
      "type": 3,
      "physicalID": 66
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip68",
      "type": 3,
      "physicalID": 67
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip69",
      "type": 3,
      "physicalID": 68
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip70",
      "type": 3,
      "physicalID": 69
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip71",
      "type": 3,
      "physicalID": 70
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip72",
      "type": 3,
      "physicalID": 71
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip73",
      "type": 3,
      "physicalID": 72
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip74",
      "type": 3,
      "physicalID": 73
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip75",
      "type": 3,
      "physicalID": 74
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip76",
      "type": 3,
      "physicalID": 75
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip77",
      "type": 3,
      "physicalID": 76
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip78",
      "type": 3,
      "physicalID": 77
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip79",
      "type": 3,
      "physicalID": 78
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip80",
      "type": 3,
      "physicalID": 79
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip81",
      "type": 3,
      "physicalID": 80
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip82",
      "type": 3,
      "physicalID": 81
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip83",
      "type": 3,
      "physicalID": 82
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip84",
      "type": 3,
      "physicalID": 83
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip85",
      "type": 3,
      "physicalID": 84
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip86",
      "type": 3,
      "physicalID": 85
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip87",
      "type": 3,
      "physicalID": 86
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip88",
      "type": 3,
      "physicalID": 87
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip89",
      "type": 3,
      "physicalID": 88
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip90",
      "type": 3,
      "physicalID": 89
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip91",
      "type": 3,
      "physicalID": 90
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip92",
      "type": 3,
      "physicalID": 91
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip93",
      "type": 3,
      "physicalID": 92
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip94",
      "type": 3,
      "physicalID": 93
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip95",
      "type": 3,
      "physicalID": 94
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip96",
      "type": 3,
      "physicalID": 95
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip97",
      "type": 3,
      "physicalID": 96
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip98",
      "type": 3,
      "physicalID": 97
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip99",
      "type": 3,
      "physicalID": 98
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip100",
      "type": 3,
      "physicalID": 99
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip101",
      "type": 3,
      "physicalID": 100
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip102",
      "type": 3,
      "physicalID": 101
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip103",
      "type": 3,
      "physicalID": 102
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip104",
      "type": 3,
      "physicalID": 103
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip105",
      "type": 3,
      "physicalID": 104
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip106",
      "type": 3,
      "physicalID": 105
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip107",
      "type": 3,
      "physicalID": 106
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip108",
      "type": 3,
      "physicalID": 107
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip109",
      "type": 3,
      "physicalID": 108
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip110",
      "type": 3,
      "physicalID": 109
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip111",
      "type": 3,
      "physicalID": 110
