facebook/fboss/fboss/agent/platforms/common/m4062nhp/M4062nhpPlatformMapping.cpp
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip112",
      "type": 3,
      "physicalID": 111
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip113",
      "type": 3,
      "physicalID": 112
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip114",
      "type": 3,
      "physicalID": 113
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip115",
      "type": 3,
      "physicalID": 114
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip116",
      "type": 3,
      "physicalID": 115
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip117",
      "type": 3,
      "physicalID": 116
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip118",
      "type": 3,
      "physicalID": 117
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip119",
      "type": 3,
      "physicalID": 118
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip120",
      "type": 3,
      "physicalID": 119
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip121",
      "type": 3,
      "physicalID": 120
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip122",
      "type": 3,
      "physicalID": 121
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip123",
      "type": 3,
      "physicalID": 122
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip124",
      "type": 3,
      "physicalID": 123
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip125",
      "type": 3,
      "physicalID": 124
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip126",
      "type": 3,
      "physicalID": 125
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip127",
      "type": 3,
      "physicalID": 126
    },
    {
      "name": "TRANSCEIVER-OSFP-slot1/chip128",
      "type": 3,
      "physicalID": 127
    },
    {
      "name": "TRANSCEIVER-QSFP28-slot1/chip129",
      "type": 3,
      "physicalID": 128
    }
  ],
  "platformSupportedProfiles": [
    {
      "factor": {
        "profileID": 38
      },
      "profile": {
        "speed": 400000,
        "iphy": {
          "numLanes": 4,
          "modulation": 2,
          "fec": 11,
          "medium": 2,
          "interfaceType": 31
        }
      }
    },
    {
      "factor": {
        "profileID": 39
      },
      "profile": {
        "speed": 800000,
        "iphy": {
          "numLanes": 8,
          "modulation": 2,
          "fec": 11,
          "medium": 2,
          "interfaceType": 4
        }
      }
    },
    {
      "factor": {
        "profileID": 45
      },
      "profile": {
        "speed": 400000,
        "iphy": {
          "numLanes": 4,
          "modulation": 2,
          "fec": 11,
          "medium": 1,
          "interfaceType": 12
        }
      }
    },
    {
      "factor": {
        "profileID": 47
      },
      "profile": {
        "speed": 100000,
        "iphy": {
          "numLanes": 1,
          "modulation": 2,
          "fec": 544,
          "medium": 2,
          "interfaceType": 0
        }
      }
    },
    {
      "factor": {
        "profileID": 50
      },
      "profile": {
        "speed": 800000,
        "iphy": {
          "numLanes": 8,
          "modulation": 2,
          "fec": 11,
          "medium": 1,
          "interfaceType": 13
        }
      }
    },
    {
      "factor": {
        "profileID": 23
      },
      "profile": {
        "speed": 100000,
        "iphy": {
          "numLanes": 4,
          "modulation": 1,
          "fec": 528,
          "medium": 2,
          "interfaceType": 31
        }
      }
    },
    {
      "factor": {
        "profileID": 25
      },
      "profile": {
        "speed": 200000,
        "iphy": {
          "numLanes": 4,
          "modulation": 2,
          "fec": 11,
          "medium": 2,
          "interfaceType": 31
        }
      }
    }
  ]
}
)";
} // namespace

namespace facebook::fboss {

M4062nhpPlatformMapping::M4062nhpPlatformMapping()
    : PlatformMapping(kJsonPlatformMappingStr) {}

M4062nhpPlatformMapping::M4062nhpPlatformMapping(
    const std::string& platformMappingStr)
    : PlatformMapping(platformMappingStr) {}

} // namespace facebook::fboss
